In [1]:
import pandas as pd
import chardet
import glob
import os
all_files = glob.glob(os.path.join("loc221csv", "2022-1 UNLOCODE CodeListPart*.csv"))
all_files

['loc221csv/2022-1 UNLOCODE CodeListPart2.csv',
 'loc221csv/2022-1 UNLOCODE CodeListPart3.csv',
 'loc221csv/2022-1 UNLOCODE CodeListPart1.csv']

In [2]:
dfs = []
for filename in all_files:
    with open(filename, 'rb') as f:
        result = chardet.detect(f.read())
        print(filename, result["encoding"])
        dfs.append(pd.read_csv(filename, encoding=result["encoding"], header=None, keep_default_na=False))

loc221csv/2022-1 UNLOCODE CodeListPart2.csv Windows-1252
loc221csv/2022-1 UNLOCODE CodeListPart3.csv ISO-8859-1
loc221csv/2022-1 UNLOCODE CodeListPart1.csv ISO-8859-1

In [3]:
df = pd.concat(dfs)
df.columns = ["Ch", "Country Code", "Location Code", "Name", "NameWoDiacritics", "SubDiv", "Function", "Status", "Date", "IATA", "Coordinates", "Remarks"]
df = df[df["Location Code"] != ""] # Remove row if location code is empty
df

,Ch,Country Code,Location Code,Name,NameWoDiacritics,SubDiv,Function,Status,Date,IATA,Coordinates,Remarks
1,,GA,AKE,Akieni,Akieni,,---4----,AI,9601,,,
2,,GA,AWE,Alowe,Alowe,,---4----,RQ,0901,,0045S 00927E,
3,,GA,BEL,Belleville,Belleville,,--3-----,RL,0607,,0002N 01102E,
4,,GA,BWN,Biawonque,Biawonque,,---4----,RQ,0901,,0040S 00927E,
5,,GA,BMM,Bitam,Bitam,,---4----,AI,9601,,,
...,...,...,...,...,...,...,...,...,...,...,...,...
54656,,FR,ZTG,Zetting,Zetting,57,--3-----,RL,1901,,4905N 00708E,
54657,,FR,ZL2,Zilia,Zilia,2B,-----6--,RL,1901,,4231N 00854E,
54658,,FR,ZWL,Zinswiller,Zinswiller,67,--3-----,RL,1901,,4855N 00735E,
54659,,FR,PCZ,Zoteux,Zoteux,62,-----6--,RL,1001,,5037N 00153E,
54660,,FR,559,Zuytpeene,Zuytpeene,59,--3-----,RL,1607,,5048N 00226E,

In [4]:
# Preprocessing
df["code"] = df["Country Code"] + df["Location Code"]
df = df.rename(columns={
    "Name": "name",
    "Function": "function"
})
df = df[["name", "code", "function"]]
df

             name   code  function
1          Akieni  GAAKE  ---4----
2           Alowe  GAAWE  ---4----
3      Belleville  GABEL  --3-----
4       Biawonque  GABWN  ---4----
5           Bitam  GABMM  ---4----
...           ...    ...       ...
54656     Zetting  FRZTG  --3-----
54657       Zilia  FRZL2  -----6--
54658  Zinswiller  FRZWL  --3-----
54659      Zoteux  FRPCZ  -----6--
54660   Zuytpeene  FR559  --3-----

[115753 rows x 3 columns]

In [5]:
source_df_sea = df[df["function"].str.contains("1")]
source_df_rail = df[df["function"].str.contains("2")]
source_df_road = df[df["function"].str.contains("3")]
source_df_air = df[df["function"].str.contains("4")]
source_df_dry = df[df["function"].str.contains("6")]

In [6]:
df_sea = pd.read_json("v2/seaports.json")
df_sea

                  name   code
0      Abu al Bukhoosh  AEABU
1                Ajman  AEAJM
2         Al Jeer Port  AEAJP
3             Mussafah  AEAMF
4             Abu Musa  AEAMU
...                ...    ...
18710          Chegutu  ZWCHE
18711         Filabusi  ZWFLU
18712           Gwanda  ZWGWA
18713           Rusape  ZWRSP
18714         Zimbabwe  ZWZMZ

[18715 rows x 2 columns]

In [7]:
df_rail = pd.read_json("v2/rails.json")
df_rail

                    name   code
0                   Fier  ALFIE
1                Elbasan  ALNPP
2                Abovyan  AMABO
3               Akhuryan  AMAHU
4                 Ararat  AMARA
...                  ...    ...
13074           Chiredzi  ZWCHI
13075             Kwekwe  ZWKWE
13076             Rusape  ZWRSP
13077  Thompson Junction  ZWTHJ
13078             Mutare  ZWUTA

[13079 rows x 2 columns]

In [8]:
df_road = pd.read_json("v2/roads.json")
df_road

                     name   code
0        Andorra la Vella  ADALV
1                 Canillo  ADCAN
2                   EscÃ s  ADEAC
3                  Encamp  ADENC
4      Escaldes-Engordany  ADESC
...                   ...    ...
89592              Shamva  ZWVM8
89593            Chinhoyi  ZWZ45
89594              Selous  ZWZMW
89595            Zimbabwe  ZWZMZ
89596          Zvishavane  ZWZVS

[89597 rows x 2 columns]

In [9]:
df_air = pd.read_json("v2/airports.json")
df_air

                         name   code
0            Andorra la Vella  ADALV
1                      Al Ain  AEAAN
2                   Abu Dhabi  AEAUH
3                   Al Dhafra  AEDHF
4     Dubai World Central Apt  AEDWC
...                       ...    ...
9193                  Mahenye  ZWMJW
9194                 Masvingo  ZWMVZ
9195                   Mutare  ZWUTA
9196           Victoria Falls  ZWVFA
9197                   Hwange  ZWWKI

[9198 rows x 2 columns]

In [10]:
df_dry = pd.read_json("v2/dryports.json")
df_dry

                          name   code
0             Andorra la Vella  ADALV
1                  Ras Al Khor  AERAK
2                        Mirfa  AERFA
3                  Stevin Rock  AESRT
4      Vopak Horizion Terminal  AEVHT
...                        ...    ...
15105                    Gokwe  ZWGOK
15106                   Gwanda  ZWGWA
15107              Marlborough  ZWMBH
15108                   Mutoko  ZWMUT
15109                   Norton  ZWNAG

[15110 rows x 2 columns]

In [11]:
import re
from tqdm.notebook import tqdm

def process(old_df, new_df, function):
    print("Before", function, len(old_df))

    with tqdm(total=new_df.shape[0]) as bar:
        for idx, row in new_df.iterrows():
            bar.update(1)
            if len(old_df[old_df["code"].eq(row["code"])]) == 0:
                old_df.loc[len(old_df)] = [row["name"], row["code"]]

    old_df = old_df.sort_values(by=['code'])
    print("After", function, len(old_df))
    print("--------------")
    return old_df

new_df_sea = process(df_sea.copy(), source_df_sea, "Sea")
new_df_rail = process(df_rail.copy(), source_df_rail, "Rail")
new_df_road = process(df_road.copy(), source_df_road, "Road")
new_df_air = process(df_air.copy(), source_df_air, "Air")
new_df_dry = process(df_dry.copy(), source_df_dry, "Dry")

Before Sea 18715

  0%|          | 0/17510 [00:00<?, ?it/s]

After Sea 18800
--------------
Before Rail 13079

  0%|          | 0/13103 [00:00<?, ?it/s]

After Rail 13089
--------------
Before Road 89597

  0%|          | 0/89811 [00:00<?, ?it/s]

After Road 89780
--------------
Before Air 9198

  0%|          | 0/9053 [00:00<?, ?it/s]

After Air 9201
--------------
Before Dry 15110

  0%|          | 0/15129 [00:00<?, ?it/s]

After Dry 15138
--------------

In [12]:
# Validate some data
assert len(new_df_air[new_df_air["code"].eq("ADALV")]) > 0
assert len(new_df_air[new_df_air["code"].eq("BRACU")]) > 0
assert len(new_df_road[new_df_road["code"].eq("ADCAN")]) > 0
assert len(new_df_road[new_df_road["code"].eq("ADENC")]) > 0

In [13]:
new_df_sea.to_json("new/seaports.json", orient='records')
new_df_rail.to_json("new/rails.json", orient='records')
new_df_road.to_json("new/roads.json", orient='records')
new_df_air.to_json("new/airports.json", orient='records')
new_df_dry.to_json("new/dryports.json", orient='records')